static drift/FoilShipRound/T0.22_Fr0.2_alpha0.0/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      nut;
}

#include      "include/initialConditions";

dimensions    [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	calculated;
		value	uniform 0;
	}


	outlet
	{
		type	calculated;
		value	uniform 0;
	}


	midPlane
	{
		type	symmetryPlane;
	}


	top
	{
		type	calculated;
		value	uniform 0;
	}


	hull
	{
		type	nutkWallFunction;
		value	uniform 0;
		blending	exponential;
	}


	deck
	{
		type	nutkWallFunction;
		value	uniform 0;
		blending	exponential;
	}


	trailingEdge
	{
		type	nutkWallFunction;
		value	uniform 0;
		blending	exponential;
	}

}
