static drift/FoilShipRound/T0.22_Fr0.2_alpha0.0/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      dynamicMeshDict;
}

dynamicFvMesh       dynamicMotionSolverFvMesh;
motionSolverLibs    ("libsixDoFRigidBodyMotion.so");
solver              sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
	patches                   (hull deck trailingEdge);
	innerDistance             0.7333333333333334;
	outerDistance             2.2;
	centreOfMass              (-0.281000000 0.000000000 0.000000000);
	mass                      218.60308;
	momentOfInertia           (9.987410001 353.561334823 361.785346645);
	rhoInf                    1;
	report                    on;
	reportToFile              on;
	value                     uniform (0 0 0);
	accelerationRelaxation    0.4;
	accelerationDamping       0.9;
	solver
	{
		type    Newmark;
	}
	constraints
	{
		zAxis
		{
			sixDoFRigidBodyMotionConstraint    line;
			direction                          (0 0 1);
		}
		yPlane
		{
			sixDoFRigidBodyMotionConstraint    axis;
			axis                               (0.000000 1.000000 0);
		}
	}
	restraints
	{
		translationDamper
		{
			sixDoFRigidBodyMotionRestraint    linearDamper;
			coeff                             8160.268538115078;
		}
		rotationDamper
		{
			sixDoFRigidBodyMotionRestraint    sphericalAngularDamper;
			coeff                             13505.141747201353;
		}
	}
}

